app/controllers/api/v1/clubs_controller.rb

SELECT "user_clubs".* FROM "user_clubs" WHERE "user_clubs"."club_id" = $1  [["club_id", 26]]
---
    def index
        clubs = Club.all

SELECT "clubs".* FROM "clubs" WHERE "clubs"."name" = $1 LIMIT $2  [["name", "PRIVATE CLUB"], ["LIMIT", 1]]
---
    def find_by_name
        club = Club.find_by(name: club_params["name"])

SELECT "user_clubs".* FROM "user_clubs" WHERE "user_clubs"."club_id" = $1  [["club_id", 26]]
---
    def update
        club = Club.find(params[:id])