app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
        movies = Movie.all