app/controllers/api/v1/subscribers_controller.rb

    def index
        subscribers = Subscriber.all
---
SELECT "subscribers".* FROM "subscribers"

    def create
        subscriber = Subscriber.create(subscriber_params)
---
INSERT INTO "subscribers" ("name", "phone_number", "email_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alex"], ["phone_number", "16313366416"], ["email_address", "alexb@test.com"], ["created_at", "2021-01-18 16:20:20.449536"], ["updated_at", "2021-01-18 16:20:20.449536"]]

    def update
        subscriber = Subscriber.find(params[:id])
        subscriber.update(subscriber_params)
---
SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subscribers" SET "updated_at" = $1, "status" = $2 WHERE "subscribers"."id" = $3  [["updated_at", "2021-01-18 03:15:56.251055"], ["status", true], ["id", 1]]

    def destroy
        subscriber = Subscriber.find(params[:id])
        subscriber.destroy
---
SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subscribers" WHERE "subscribers"."id" = $1  [["id", 2]]