app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "birthday", "image", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @user = User.create(user_params)