app/models/notification.rb

    def self.send_sms(body, media_url)

        media_arr = media_url.split(',')

        # binding.pry
        account_sid = ENV['TWILIO_ACCOUNT_SID']
        auth_token = ENV['TWILIO_AUTH_TOKEN']

        @client = Twilio::REST::Client.new(account_sid, auth_token)

        #! create if statement - if media_arr is empty use send out without media_url key
        numbers_to_message = Subscriber.all
        subscribed = numbers_to_message.select { |subscriber| subscriber.status == true}
---
SELECT "subscribers".* FROM "subscribers"